v3/app/controllers/api/v3/token_controller.rb

  def create
    login = params[:login].to_s.strip.downcase
    password = params[:password]

    user = User.find_by(login: login)
    if !user || !user.authenticate(password)
      render :json => { :status => 400, :error => "Invalid." }.to_json and return
    end

    ip = request.remote_ip
    timenow = Time.now.utc

    # CREATE A TOKEN
    token = UserToken.new_token(ip)
    render :json => { :status => 400, :error => "Invalid." }.to_json if !token

    user_token = UserToken.new
    user_token.user_id = user.id
    user_token.token = token
    user_token.ip = ip
    user_token.timenow = timenow
    user_token.save
---
SELECT `users`.* FROM `users` WHERE `users`.`login` = 'gnomicos' LIMIT 1
INSERT INTO `user_tokens` (`user_id`, `token`, `created_at`, `updated_at`, `ip`, `timenow`) VALUES (1, '0e1467a6eb0a651b0713696d7039966af8e132f22173f1f9d31ba22fbf7808976128445141fe187c2af8959687ce85676ced262b70e4b6752b21521e3b550e75', '2020-11-05 21:57:00', '2020-11-05 21:57:00', '172.19.0.7', '2020-11-05 21:57:00')