v3/app/controllers/api/v3/user_controller.rb

  def sign_in
    login = params[:login].to_s.strip.downcase
    password = params[:password]

    user = User.find_by(login: login)
    if !user || !user.authenticate(password)
      render :json => { :status => 400, :error => "Invalid." }.to_json and return
    end

    token = SecureRandom.hex(64) # 128 characters
    ip = request.remote_ip
    timenow = Time.now.utc

    user_token = UserToken.new
    user_token.user_id = user.id
    user_token.token = token
    user_token.ip = ip
    user_token.timenow = timenow
    user_token.save
---
SELECT `users`.* FROM `users` WHERE `users`.`login` = 'gnomicos' LIMIT 1
INSERT INTO `user_tokens` (`user_id`, `token`, `created_at`, `updated_at`, `ip`, `timenow`) VALUES (332, '600b698580c5d0501647e436fd0d02d2c0ae1bb4425995201bffe7a125ab974822f6258fedafceabe08b11af265293535f26d7c3af1bd20aeeae0ea97c936d9a', '2020-10-16 15:22:02', '2020-10-16 15:22:02', '::1', '2020-10-16 15:22:02')