v3/app/models/user.rb

    def self.set_permission(user_id,permission_id,val)
      user = User.find_by(id: user_id)
      return false if !user

      permission_ids = Permission.permission_ids
      return false if !permission_ids[permission_id]

      if !val and user.permission_ids.index(".#{permission_id}.")
        # REPLACE ALL INSTANCES OF ".<ID>." WITH "." (THERE SHOULD ONLY BE ONE)
        user.permission_ids.gsub!(".#{permission_id}.",".")
      elsif val and !user.permission_ids.index(".#{permission_id}.")
        # APPEND "<ID>." IF NOT ".<ID>."
        user.permission_ids += ("#{permission_id}.")
      end

      user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`permission_ids` = '.1.4.', `users`.`updated_at` = '2020-11-05 21:57:25' WHERE `users`.`id` = 1